## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_manifest.argocd-gateway will be updated in-place
!   resource "kubernetes_manifest" "argocd-gateway" {
!       manifest = {
!           spec       = {
!               servers  = [
                    {
                        hosts = [
                            "argocd.wayofthesys.org",
                        ]
                        port  = {
                            name     = "http"
                            number   = 80
                            protocol = "HTTP"
                        }
                        tls   = {
                            httpsRedirect = false
                        }
                    },
!                   {
!                       tls   = {
!                           credentialName = "argocd-cert" -> "argo-cert"
                            # (1 unchanged element hidden)
                        }
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # kubernetes_manifest.virtualservice_resource will be updated in-place
!   resource "kubernetes_manifest" "virtualservice_resource" {
!       manifest = {
!           spec       = {
!               http     = [
!                   {
!                       route = [
!                           {
!                               destination = {
!                                   port = {
!                                       number = 80 -> 443
                                    }
                                    # (1 unchanged element hidden)
                                }
                            },
                        ]
                        # (1 unchanged element hidden)
                    },
                ]
                # (2 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # kubernetes_secret.argocd-tls must be replaced
-/+ resource "kubernetes_secret" "argocd-tls" {
!       id        = "argocd/argo-cert" -> (known after apply)
-       immutable = false -> null
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
            name             = "argo-cert"
!           namespace        = "argocd" -> "istio-system" # forces replacement
!           resource_version = "1259822" -> (known after apply)
!           uid              = "5f0e0cb5-a58a-41f5-81d6-3af187fcd142" -> (known after apply)
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
